UchetProgressa/src/Catalogs/Цель/Цель.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Цель</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетВедется</name>
    <type>
      <types>CatalogRef.ЕденицыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Целое</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Доля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Название</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Путь</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Выполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительнаяИнформация</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВыборочноеПрохождение</name>
    <attributes>
      <name>Часть</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выплонение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

UchetProgressa/src/InformationRegisters/Прогресс/Прогресс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Прогресс</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <attributes>
    <name>Название</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Путь</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Время</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Цель</name>
    <type>
      <types>CatalogRef.Цель</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UchetProgressa/src/Catalogs/Цель/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
	Процедура ПриОткрытии(Отказ)
	УстановкаОтбораВТЧПрогресс();

	ПередЗаписьюНаСервере() ;
	КонецПроцедуры

	&НаСервере
	Процедура ПередЗаписьюНаСервере()
		//Вставить содержимое обработчика
		 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		// Данный фрагмент построен конструктором.
		// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	    Если Объект.Ссылка  <> Справочники.Цель.ПустаяСсылка() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПрогрессСрезПоследних.Название КАК Название,
			|	ПрогрессСрезПоследних.Путь КАК Путь
			|ИЗ
			|	РегистрСведений.Прогресс.СрезПоследних КАК ПрогрессСрезПоследних
			|ГДЕ
			|	ПрогрессСрезПоследних.Цель = &Цель";
		
		Запрос.УстановитьПараметр("Цель", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если РезультатЗапроса.Пустой() =  Ложь     Тогда
		
	    Объект.Название = РезультатЗапроса.Выгрузить()[0].Название ; 
		Объект.Путь =  РезультатЗапроса.Выгрузить()[0].Путь ;
		КонецЕсли
		
		КонецЕсли

		
	КонецПроцедуры

	&НаКлиенте
	Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		ПередЗаписьюНаСервере();
	КонецПроцедуры

	&НаКлиенте
	Процедура ПутьОткрытие(Элемент, СтандартнаяОбработка)
		// Вставить содержимое обработчика.
		СтандартнаяОбработка =Ложь ;
		ЗапуститьПриложение(Объект.Путь );
	КонецПроцедуры

	&НаКлиенте
	Процедура ОстановилсяНаОткрытие(Элемент, СтандартнаяОбработка)
		// Вставить содержимое обработчика.
		СтандартнаяОбработка =Ложь ;
		ЗапуститьПриложение(Объект.Путь+Объект.Название);	
	КонецПроцедуры

&НаКлиенте
	Процедура ПослеЗаписи(ПараметрыЗаписи)
		//Вставить содержимое обработчика
		УстановкаОтбораВТЧПрогресс()  ;
	КонецПроцедуры

&НаКлиенте
Процедура УстановкаОтбораВТЧПрогресс()  ;
	ЭлементОтбора = Прогресс.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Цель");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;

	
КонецПроцедуры


&НаКлиенте
Процедура ДополнительнаяИнформацияЗначениеОткрытие(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Элемент.ТекстРедактирования);

КонецПроцедуры
